import styled from "styled-components";
import Button from "../../components/styled/Button";
import { Container } from "../../components/styled/Global";
import { useNavigate } from "react-router-dom";
import { useEffect, useState } from "react";

const RulesContainer = styled.div`
  text-align: left;
`;

const Rules = () => {
  const [isLegal, setIslegal] = useState(false);
  const navigate = useNavigate();
  useEffect(() => {
    const urlParams = new URL(window.location.href);
    const isLegalProps = urlParams.searchParams.get("isLegal");
    if (isLegalProps) {
      setIslegal(true);
    }
  }, []);

  return (
    <Container>
      <RulesContainer>
        <div>
          {isLegal ? (
            <p>
              შპს „XXX XXXXX“ (ს/ნ: XXXXXXXXX) -ს უფლებამოსილი წარმოდგენილი
              ------------------------------ (პ/ნ: 00000000000), გამოვხატავ
              თანხმობას და უფლებას ვაძლევ შპს „თეგეტა ლიზინგს“ (საიდენტიფიკაციო
              ნომერი: 201948544) საქართველოს კანონმდებლობით დადგენილი წესით და
              პირობებით, დაამუშაოს  წინამდებარე განაცხადში, კრედიტორთან დაცული,
              ასევე, ჩემ შესახებ საკრედიტო საინფორმაციო ბიუროებში დაცული და მათ
              მიერ მოწოდებული ინფორმაცია ჩემი, როგორც მომავალი ლიზინგის
              მიმღები/თანამსესხებლის /თავდების/უზრუნველყოფის საშუალების
              მიმწოდებლის გადახდისუნარიანობის ანალიზის მიზნით. გაცნობიერებული
              მაქვს საქართველოს კანონმდებლობით გათვალისწინებული უფლებები, რომ
              მონაცემთა სუბიექტის/მომხმარებლის მოთხოვნის შემთხვევაში, მონაცემთა
              დამმუშავებელი ვალდებულია გაასწოროს, განაახლოს, დაამატოს, დაბლოკოს,
              წაშალოს ან გაანადგუროს მონაცემები, თუ ისინი არასრულია, არაზუსტია,
              არ არის განახლებული, ან თუ მათი შეგროვება და დამუშავება
              განხორციელდა კანონის საწინააღმდეგოდ.
              <br /> <br /> აღნიშნული თანხმობა  მოქმედია
              ხელმოწერიდან/დადასტურებიდან 30 სამუშაო დღის განმავლობაში
              (იურიდიული პირის შემთხვევაში 60 სამუშაო დღის განმავლობაში).
            </p>
          ) : (
            <p>
              მე, ----- ---------------- ( პ/ნ: XXXXXXXXXXX), გამოვხატავ
              თანხმობას და უფლებას ვაძლევ შპს „თეგეტა ლიზინგს“ (საიდენტიფიკაციო
              ნომერი: 201948544) საქართველოს კანონმდებლობით დადგენილი წესით და
              პირობებით, დაამუშაოს  წინამდებარე განაცხადში, კრედიტორთან დაცული,
              ასევე, ჩემ შესახებ საკრედიტო საინფორმაციო ბიუროებში დაცული და მათ
              მიერ მოწოდებული ინფორმაცია ჩემი, როგორც მომავალი ლიზინგის
              მიმღები/თანამსესხებლის /თავდების/უზრუნველყოფის საშუალების
              მიმწოდებლის გადახდისუნარიანობის ანალიზის მიზნით. გაცნობიერებული
              მაქვს საქართველოს კანონმდებლობით გათვალისწინებული უფლებები, რომ
              მონაცემთა სუბიექტის/მომხმარებლის მოთხოვნის შემთხვევაში, მონაცემთა
              დამმუშავებელი ვალდებულია გაასწოროს, განაახლოს, დაამატოს, დაბლოკოს,
              წაშალოს ან გაანადგუროს მონაცემები, თუ ისინი არასრულია, არაზუსტია,
              არ არის განახლებული, ან თუ მათი შეგროვება და დამუშავება
              განხორციელდა კანონის საწინააღმდეგოდ.
              <br />
              <br />
              აღნიშნული თანხმობა  მოქმედია ხელმოწერიდან/დადასტურებიდან 30
              სამუშაო დღის განმავლობაში (იურიდიული პირის შემთხვევაში 60 სამუშაო
              დღის განმავლობაში).
            </p>
          )}
        </div>
        <Button onClick={() => navigate(isLegal ? "/form?isLegal=1" : "/form")} small>
          შეავსე ფორმა
        </Button>
      </RulesContainer>
    </Container>
  );
};

export default Rules;
