import { useNavigate } from "react-router-dom";
import Footer from "../../components/layout/Footer";
import Header from "../../components/layout/Header";
import Button from "../../components/styled/Button";
import { Center, Flex, Title } from "../../components/styled/Global";
import { EndContainer, EndContainerBlock, EndContainerBox } from "./styled";

const EndStep2 = () => {
  const navigate = useNavigate();
  return (
    <Center>
      <Header />
      <EndContainer>
        <EndContainerBlock>
          <Title>თანხმობა ავტოტექმომსახურების სტანდარტულ პირობებზე</Title>
          <EndContainerBox>
            <p>
              გაცნობებთ, რომ თანხმობის შემთხვევაში თქვენი მონაცემები დამუშავდება
              პირდაპირი მარკეტინგის მიზნებისთვის, ასევე, განხორციელდება თქვენი
              მონაცემების პროფაილინგი, რაც წარმოადგენს მონაცემთა ავტომატური
              დამუშავების ფორმას და რაც გულისხმობს მონაცემების გამოყენებას
              თქვენთან დაკავშირებული გარკვეული პიროვნული მახასიათებლების
              შესაფასებლად (მაგ: თქვენზე მორგებული შეთავაზებების გასაკეთებლად
              დამუშავდება ის მონაცემები, თუ რომელი სატრანსპორტო საშუალებაა
              თქვენს მფლობელობაში და რომელ პროდუქტს ყიდულობთ კომპანიაში ყველაზე
              ხშირად).
            </p>
            <p>
              გაცნობებთ, რომ პირდაპირ მარკეტინგს განვახორციელებთ ტელეფონის,
              ელექტრონული ფოსტის მეშვეობით ან სხვა ელექტრონული საშუალებით (მაგ.
              აპლიკაცია, ვებ.გვერდი...) და აღნიშნულს უზრუნველვყოფთ იმისათვის,
              რომ მოგაწოდოთ ინფორმაცია თქვენზე მორგებული პროდუქტებისა და
              შეთავაზებების, ფასდაკლებების, აქციების, ახალი წამოწყების ან სხვა
              სიახლეების თაობაზე.
            </p>
            <p>
              გთხოვთ, გაითვალისწინეთ, რომ თანხმობის შემთხვევაში, თქვენი
              პერსონალური მონაცემები პირდაპირი მარკეტინგის მიზნებისთვის
              დამუშავდება „თეგეტას ჯგუფში“ შემავალი კომპანიების მიერ (იმ
              შემთხვევაში, თუ გსურთ, რომ არ დამუშავდეს სიაში მოცემული რომელიმე
              კომპანიის მიერ, გთხოვთ, მონიშნოთ შესაბამისი ღილაკი), ამასთან,
              დამუშავდება ის პერსონალური მონაცემები, რაც დაცულია „თეგეტას
              ჯგუფში“ შემავალ კომპანიებში (დეტალური ჩამონათვალი ლინკზე) და რაც
              მოიცავს შემდეგს: სახელი, გვარი, პირადი ნომერი, ტელეფონის ნომერი,
              ფაქტობრივი მისამართი, სქესი, ელექტრონული ფოსტის მისამართი, თქვენს
              მფლობელობაში არსებული სატრანსპორტო საშუალების მონაცემები და
              „თეგეტას ჯგუფში“ თქვენ მიერ განხორციელებული აქტივობები/ოპერაციები,
              შესაბამისად, თითოეული კომპანია უფლებამოსილია მოითხოვოს „თეგეტას
              ჯგუფის“ სხვა კომპანიებიდან თქვენს შესახებ არსებული ინფორმაცია, რაც
              ინახება შესაბამის კომპანიაში.
            </p>
            <p>
              ამასთან, თანხმობის ფორმის დადასტურებით თქვენ აცხადებთ, რომ
              ინფორმირებული ხართ საქართველოს კანონმდებლობით მონიჭებული თქვენი
              უფლებების თაობაზე, მათ შორის, აცნობიერებთ, რომ თქვენ გაქვთ უფლება
              ნებისმიერ დროს გამოითხოვოთ თქვენ მიერ გამოხატული ნება/უარი თქვათ
              მონაცემების პირდაპირი მარკეტინგის გზით დამუშავებაზე შემდეგი
              საშუალებებით: თითოეული კომპანიის SMS შეტყობინების მიღებაზე უარის
              თქმისთვის - შესაბამისი კომპანიის მიერ გაგზავნილ შეტყობინებაზე -
              SMS OFF-ის გამოყენებით, რომელიც უფასოა;
            </p>
            <p>
              თითოეული კომპანიის ელ. შეტყობინების მიღებაზე უარის თქმისთვის -
              შესაბამისი კომპანიის მიერ გაგზავნილ ელ. შეტყობინებაზე ელ.ფოსტის
              მისამართზე შეტყობინების მიღებისას - ამავე ელ.ფოსტის მისამართზე
              უარის დაფიქსირებით. ყველა ზემოთჩამოთვლილ შემთხვევაში ჩვენ
              ვალდებული ვართ მომართვიდან არაუმეტეს 7 (შვიდი) სამუშაო დღის ვადაში
              შევწყვიტოთ თქვენი მონაცემების პირდაპირი მარკეტინგის მიზნით
              დამუშავება.
            </p>
          </EndContainerBox>
          <Flex className="full-mobile">
            <Button light onClick={() => navigate("/success")}>გამოტოვება</Button>
            <Button onClick={() => navigate("/success")}>ვადასტურებ</Button>
          </Flex>
        </EndContainerBlock>
      </EndContainer>
      <EndContainerBlock>
        <Footer fullWidth active={7} />
      </EndContainerBlock>
    </Center>
  );
};

export default EndStep2;
