import { FC } from "react";
import styled from "styled-components";

const SidebarContainer = styled.div`
  flex: 1;
  font-size: 16px;
  font-style: normal;
  font-weight: 400;
  line-height: 24px;
  background: #f7f8f9;
  padding: 0 88px;

  @media (max-width: 992px) {
    padding: 18px;
    font-size: 14px;
    padding-bottom: 60px;
  }

  p {
    margin-bottom: 16px;
  }
`;

interface IProps {
  isCompany?: boolean;
}

const Sidebar: FC<IProps> = ({ isCompany }) => {
  return (
    <SidebarContainer>
      {isCompany ? (
        <>
          <p>
            გთხოვთ, გაითვალისწინეთ, რომ თქვენი თანხმობის შემთხვევაში,
            პერსონალური მონაცემები, ასევე, გადაეცემა და პირდაპირი მარკეტინგის
            მიზნებისთვის დამუშავდება „თეგეტას ჯგუფში“ შემავალი და პარტნიორი
            კომპანიების მიერ.
          </p>
          <p>
            იმ შემთხვევაში, თუ გსურთ, რომ თქვენი მონაცემები არ დამუშავდეს სიაში
            მოცემული რომელიმე კომპანიის მიერ, გთხოვთ, მონიშნოთ შესაბამისი ველი.
          </p>
        </>
      ) : (
        <>
          <p>
            <b>
              თანხმობა პირდაპირი მარკეტინგის მიზნებისთვის პერსონალური მონაცემების
              დამუშავების თაობაზე
            </b>
          </p>
          <p>
            გაცნობებთ, რომ 2024 წლის 01 მარტიდან ცვლილება შედის „პერსონალურ
            მონაცემთა დაცვის შესახებ“ საქართველოს კანონში და იმისათვის, რომ
            თქვენი, როგორც მონაცემთა სუბიექტის პერსონალური მონაცემები დავამუშაოთ
            პირდაპირი მარკეტინგის მიზნებისთვის, აუცილებელია, რომ მოვიპოვოთ
            თქვენი <b>ინფორმირებული და ნებაყოფლობითი თანხმობა.</b>
          </p>
          <p>
            იმ შემთხვევაში, თუ თქვენი სურვილია, რომ 2024 წლის 01 მარტიდან მიიღოთ
            მარკეტინგული სახის შეტყობინებები ასევე, განხორციელდეს თქვენი
            მონაცემების პროფაილინგი და ხართ არანაკლებ 16 წლის, გთხოვთ, გაიაროთ
            იდენტიფიკაცია/ვერიფიკაცია.
          </p>
        </>
      )}
    </SidebarContainer>
  );
};

export default Sidebar;
